const headers = ["Компания", "Название", "Процессор", "Экран (Д)", "Камера (МПикс)", "Батарея (мАч)", "Цена (руб)"];

let table_data = [
    ['Xiaomi', '12 Pro', 'Qualcomm', 6.73, 50, 4600, 70000],
    ['Samsung', 'Galaxy S22 Ula', 'Exynos 2200', 6.8, 108, 5000, 69000],
    ['Apple', 'Iphone 7', 'Apple A10', 4.7, 12, 1960, 35000],
    ['Huawei', 'Mate50 Pro', 'Snapdragon 8+ Gen1 4G', 6.7, 50, 4460, 64000],
    ['Redmi', 'Note 10', 'Qualcomm Snapdragon 678', 6.43, 48, 5000, 17990],
    ['Apple', 'Iphone X', 'A11 Bionic', 5.8, 12, 2716, 45000],
    ['Samsung', 'A51', 'Exynos 9611', 6.5, 48, 4000, 19000],
    ['Тест', '1', '-', 0, 0, 0, 500],
    ['Тест', '1', '-', 0, 0, 0, 2300],
    ['Тест', '1', '-', 0, 0, 0, 11000],
    ['Тест', '2', '-', 0, 0, 0, 750],
    ['Тест', '2', '-', 0, 0, 0, 3500],
    ['Тест', '2', '-', 0, 0, 0, 15999],
]